#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
	ЮТТесты.ДобавитьТестовыйНабор("Проверка движений по остаточным регистрам.Позитив", "Проверка движений").ВТранзакции()
        .ДобавитьТест("ПроверкаДвиженийПоРегистрамВНольПриходаТовараПозитив", "Проверка движения по остаточным регистрам ТоварныеЗапасы и Взаиморасчеты выходят в ноль", "Позитив")
	   ; 

КонецПроцедуры

Процедура ПроверкаДвиженийПоРегистрамВНольПриходаТовараПозитив() Экспорт
	
	СтруктураПараметров = СозданиеРасходаТовараПоПриходуТовараПозитив(); 
	
	РасходТовара = СтруктураПараметров.РасходТовара;
	РасходТовара.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
	
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы.Остатки";
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Склад");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Товар");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("КоличествоОстаток");
	ОписаниеЗапроса.Условия.Добавить("Склад = &Склад");
	ОписаниеЗапроса.Условия.Добавить("Товар = &Товар");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Склад", СтруктураПараметров.Склад);
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Товар", СтруктураПараметров.ТестовыйТовар);
	
	РезультатЗапроса = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса);
	
	ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапроса))
		.ЭтоИстина();	
	
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.Взаиморасчеты.Остатки";
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Валюта");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Контрагент");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("СуммаОстаток");
	ОписаниеЗапроса.Условия.Добавить("Валюта = &Валюта");
	ОписаниеЗапроса.Условия.Добавить("Контрагент = &Контрагент");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Валюта", СтруктураПараметров.Валюта);
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Контрагент", СтруктураПараметров.Контрагент);
	
	РезультатЗапроса = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса);
	
	ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапроса))
		.ЭтоИстина();   
		
КонецПроцедуры 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция СозданиеРасходаТовараПоПриходуТовараПозитив() Экспорт
	
   	ТестовыйТовар = Справочники_МО.СозданиеТовара("Тестовый");
	Цена 		= 15;
	Количество 	= 2;
	Сумма 		= 30;
	
	ПриходТовара = Док_ПриходТовара_МО.СозданиеДокументаПриходТовара(ТестовыйТовар,Цена,Количество,Сумма);  
	
	ПриходТовара.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
	
	КонструкторРасхода =  ЮТест.Данные().КонструкторОбъекта("Документы.РасходТовара")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля      
		.ФикцияРеквизитов("ВидЦен")	                 
		.Установить("Дата",ТекущаяДатаСеанса())
		.Установить("Покупатель",ПриходТовара.Поставщик) 
		.Установить("Склад",ПриходТовара.Склад)
		.Установить("Валюта",ПриходТовара.Валюта)
		.Установить("Организация",ПриходТовара.Организация)
		.ТабличнаяЧасть("Товары")                          
			.ДобавитьСтроку()                                                          
			.Установить("Товар", ТестовыйТовар)
			.Установить("Цена",Цена)  
			.Установить("Количество",Количество)              
			.Установить("Сумма",Сумма)
			;
			
  	РасходТовара = КонструкторРасхода.Записать(); 
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РасходТовара",	РасходТовара);
	СтруктураПараметров.Вставить("Склад",			ПриходТовара.Склад);
	СтруктураПараметров.Вставить("ТестовыйТовар",	ТестовыйТовар);
	СтруктураПараметров.Вставить("Контрагент",		ПриходТовара.Поставщик);
	СтруктураПараметров.Вставить("Валюта",			ПриходТовара.Валюта);
	
	Возврат СтруктураПараметров;

КонецФункции  

#КонецОбласти