#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("Документ Приход товара.Позитив","Проверка объекта").ВТранзакции()
	   	.ДобавитьТест("ПроверкаСозданиеПриходаТовараПозитив", "Проверка создание документа", "Позитив")
		.ДобавитьТест("ПроверкаПроведенияПриходаТовараПозитив", "Проерка проведения документа", "Позитив")
		.ДобавитьТест("ПроверкаПроведенияИНаличиеДвиженийПриходаТовараПозитив", "Проверка проведения документ и наличия движений документа", "Позитив")
		;
   
КонецПроцедуры

Процедура ПроверкаСозданиеПриходаТовараПозитив() Экспорт

	ПриходТовара =  ФиксированныеТестовыеПараметрыПрихода();

		
	ЮТест.ОжидаетЧто(ПриходТовара.ПолучитьОбъект())
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Запись)
		.НеВыбрасываетИсключение()
		;		
		
КонецПроцедуры 

Процедура ПроверкаПроведенияПриходаТовараПозитив() Экспорт
	
	ПриходТовара =  ФиксированныеТестовыеПараметрыПрихода();
	
	ЮТест.ОжидаетЧто(ПриходТовара.ПолучитьОбъект())
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение)
		.НеВыбрасываетИсключение()
		;		
		
КонецПроцедуры 

Процедура ПроверкаПроведенияИНаличиеДвиженийПриходаТовараПозитив() Экспорт
	
	ПриходТовара =  ФиксированныеТестовыеПараметрыПрихода();
	
	ПриходТовара.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
	
	ЮТест.ОжидаетЧто(ЮТЗапросы.ДвиженияДокумента(ПриходТовара, "Взаиморасчеты"))
		.Заполнено()
		;
	ЮТест.ОжидаетЧто(ЮТЗапросы.ДвиженияДокумента(ПриходТовара, "ТоварныеЗапасы"))
		.Заполнено()
		;    		
		
КонецПроцедуры 
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции     
Функция ФиксированныеТестовыеПараметрыПрихода() Экспорт

	ТестовыйТовар = Справочники_МО.СозданиеТовара("Тестовый");
	
	Цена 		= 10;
	Количество 	= 5;
	Сумма		= 50;
	
	ФиксированныйПриходТовара =  СозданиеДокументаПриходТовара(ТестовыйТовар,Цена,Количество,Сумма);

	Возврат ФиксированныйПриходТовара;
	
КонецФункции

Функция СозданиеДокументаПриходТовара(ТестовыйТовар,Цена,Количество,Сумма) Экспорт
	
	КонструкторПрихода =  ЮТест.Данные().КонструкторОбъекта("Документы.ПриходТовара")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля      
		.ФикцияРеквизитов("Поставщик, Склад, Валюта, Организация")	                 
		.Установить("Дата",ТекущаяДатаСеанса() -100)
		.ТабличнаяЧасть("Товары")                          
			.ДобавитьСтроку()                                                          
			.Установить("Товар", ТестовыйТовар)
			.Установить("Цена",Цена)  
			.Установить("Количество",Количество)              
			.Установить("Сумма",Сумма)
			;
			
  	ПриходТовара = КонструкторПрихода.Записать();    
	
 	Возврат ПриходТовара; 
	
КонецФункции
#КонецОбласти