   #Область СлужебныйПрограммныйИнтерфейс
   
Процедура ИсполняемыеСценарии() Экспорт
       
   ЮТТесты.ДобавитьТестовыйНабор("Документ Расход товара.Позитив","Проверка объекта").ВТранзакции()
	   .ДобавитьТест("ПроверкаСозданиеРасходаТовараПозитив", "Проверка создание документа", "Позитив")
	   .ДобавитьТест("ПроверкаПроведенияРасходаТовараПозитив", "Проерка проведения документа (с учётом прихода товара)", "Позитив")
	   .ДобавитьТест("ПроверкаПроведенияИНаличиеДвиженийРасходаТовараПозитив", "Проверка проведения документ и наличия движений документа (с учётом прихода товара)", "Позитив")
	   ;  
	   
      ЮТТесты.ДобавитьТестовыйНабор("Документ Расход товара.Негатив","Проверка объекта").ВТранзакции()
	   .ДобавитьТест("ПроверкаПроведенияРасходаТовараНегатив", "Проерка проведения документа (без учёта прихода товара)", "Негатив")
	  ; 

 
КонецПроцедуры
   
Процедура ПроверкаСозданиеРасходаТовараПозитив() Экспорт

	РасходТовара =  ФиксированныеТестовыеПараметрыРасхода();
   	
	ЮТест.ОжидаетЧто(РасходТовара.ПолучитьОбъект())
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Запись)
		.НеВыбрасываетИсключение()
		;		
		
КонецПроцедуры 

Процедура ПроверкаПроведенияРасходаТовараПозитив() Экспорт
	
	РасходТовара = Движения_МО.СозданиеРасходаТовараПоПриходуТовараПозитив().РасходТовара;
	
	ЮТест.ОжидаетЧто(РасходТовара.ПолучитьОбъект())
		.Метод("Записать", ЮТМетоды.МассивПараметров(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный))
		.НеВыбрасываетИсключение()
		;		
		
КонецПроцедуры 

Процедура ПроверкаПроведенияИНаличиеДвиженийРасходаТовараПозитив() Экспорт
	
	РасходТовара = Движения_МО.СозданиеРасходаТовараПоПриходуТовараПозитив().РасходТовара;
	
	РасходТовара.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
	
	ЮТест.ОжидаетЧто(ЮТЗапросы.ДвиженияДокумента(РасходТовара, "Взаиморасчеты"))
		.Заполнено()
		;
	ЮТест.ОжидаетЧто(ЮТЗапросы.ДвиженияДокумента(РасходТовара, "ТоварныеЗапасы"))
		.Заполнено()
		;    		
		
КонецПроцедуры 

Процедура ПроверкаПроведенияРасходаТовараНегатив() Экспорт
	
	РасходТовара =  ФиксированныеТестовыеПараметрыРасхода();
	
	ЮТест.ОжидаетЧто(РасходТовара.ПолучитьОбъект())
		.Метод("Записать", ЮТМетоды.МассивПараметров(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный))
		.ВыбрасываетИсключение("Не удалось провести ""Продажа")
		;		
		
КонецПроцедуры 


#КонецОбласти

#Область СлужебныеПроцедурыИФункции     
Функция ФиксированныеТестовыеПараметрыРасхода()

	ТестовыйТовар = Справочники_МО.СозданиеТовара("Тестовый");
	
	Цена 		= 10;
	Количество 	= 5;
	Сумма		= 50;
	
	ФиксированныйРасходТовара =  СозданиеДокументаРасходТовара(ТестовыйТовар,Цена,Количество,Сумма);

	Возврат ФиксированныйРасходТовара;
	
КонецФункции

Функция СозданиеДокументаРасходТовара(ТестовыйТовар,Цена,Количество,Сумма) Экспорт
	
	КонструкторРасхода =  ЮТест.Данные().КонструкторОбъекта("Документы.РасходТовара")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля      
		.ФикцияРеквизитов("Склад, Валюта, Организация, Покупатель, ВидЦен")	                 
		.Установить("Дата",ТекущаяДатаСеанса())
		.ТабличнаяЧасть("Товары")                          
			.ДобавитьСтроку()                                                          
			.Установить("Товар", ТестовыйТовар)
			.Установить("Цена",Цена)  
			.Установить("Количество",Количество)              
			.Установить("Сумма",Сумма)
			;
			
  	РасходТовара = КонструкторРасхода.Записать();    
	
 	Возврат РасходТовара; 
	
КонецФункции
#КонецОбласти